Aircoookie/WLED/tools/ESP32-Chip_info.hpp
// see https://github.com/espressif/arduino-esp32/blob/master/libraries/ESP32/examples/ResetReason/ResetReason.ino
/* Print last reset reason of ESP32
*  =================================
*  Use either of the methods print_reset_reason
*  or verbose_print_reset_reason to display the
*  cause for the last reset of this device.
*
*  Public Domain License.
*  Author:
*  Evandro Luis Copercini - 2017
*/
#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(4, 0, 0)
#if CONFIG_IDF_TARGET_ESP32 // ESP32/PICO-D4
#include <esp32/rom/rtc.h>
#elif CONFIG_IDF_TARGET_ESP32S2
#include <esp32s2/rom/rtc.h>
#elif CONFIG_IDF_TARGET_ESP32C3
#include <esp32c3/rom/rtc.h>
#elif CONFIG_IDF_TARGET_ESP32S3
#include <esp32s3/rom/rtc.h>
#else 
#error Target CONFIG_IDF_TARGET is not supported
#endif
#else // ESP32 Before IDF 4.0
#include <rom/rtc.h>
#endif

#if 0
// ESP8266 does this a bit differently
//
// include <user_interface.h>
// 
//  struct rst_info * rst_info;
//  system_rtc_mem_read(0, &rst_info, sizeof(rst_info));
//  reason = rst_info->reason;
//     or
//  reason = ESP.getResetInfoPtr()->reason;
// 
//    REASON_DEFAULT_RST      = 0,    /* normal startup by power on */
//    REASON_WDT_RST          = 1,    /* hardware watch dog reset */
//    REASON_EXCEPTION_RST    = 2,    /* exception reset, GPIO status won’t change */
//    REASON_SOFT_WDT_RST     = 3,    /* software watch dog reset, GPIO status won’t change */
//    REASON_SOFT_RESTART     = 4,    /* software restart ,system_restart , GPIO status won’t change */
//    REASON_DEEP_SLEEP_AWAKE = 5,    /* wake up from deep-sleep */
//    REASON_EXT_SYS_RST      = 6     /* external system reset */
//    reason > 6 = user-defined reason codes
#endif

void my_print_reset_reason(int reason)
{
  Serial.print(reason);
  switch (reason)
  {
    case 0 : Serial.print ("  NO_MEAN"); break;
    case 1 : Serial.print ("  POWERON_RESET");break;          /**<1,  Vbat power on reset*/
    case 2 : Serial.print ("  unknown exception"); break;     /**<2,  this code is not defined on ESP32 */
    case 3 : Serial.print ("  SW_RESET");break;               /**<3,  Software reset digital core*/
    case 4 : Serial.print ("  OWDT_RESET");break;             /**<4,  Legacy watch dog reset digital core*/
    case 5 : Serial.print ("  DEEPSLEEP_RESET");break;        /**<5,  Deep Sleep wakeup reset digital core*/
    case 6 : Serial.print ("  SDIO_RESET");break;             /**<6,  Reset by SLC module, reset digital core*/
    case 7 : Serial.print ("  TG0WDT_SYS_RESET");break;       /**<7,  Timer Group0 Watch dog reset digital core*/
    case 8 : Serial.print ("  TG1WDT_SYS_RESET");break;       /**<8,  Timer Group1 Watch dog reset digital core*/
    case 9 : Serial.print ("  RTCWDT_SYS_RESET");break;       /**<9,  RTC Watch dog Reset digital core*/
    case 10 : Serial.print(" INTRUSION_RESET");break;         /**<10, Instrusion tested to reset CPU*/
    case 11 : Serial.print(" TGWDT_CPU_RESET");break;         /**<11, Time Group reset CPU*/
    case 12 : Serial.print(" SW_CPU_RESET");break;            /**<12, Software reset CPU*/
    case 13 : Serial.print(" RTCWDT_CPU_RESET");break;        /**<13, RTC Watch dog Reset CPU*/
    case 14 : Serial.print(" EXT_CPU_RESET");break;           /**<14, for APP CPU, reseted by PRO CPU*/
    case 15 : Serial.print(" RTCWDT_BROWN_OUT_RESET");break;  /**<15, Reset when the vdd voltage is not stable*/
    case 16 : Serial.print(" RTCWDT_RTC_RESET");break;        /**<16, RTC Watch dog reset digital core and rtc module*/
    case 17 : Serial.print(" TG1WDT_CPU_RESET");break;        /**<17, Time Group1 reset CPU*/
    case 18 : Serial.print(" SUPER_WDT_RESET");break;         /**<18, super watchdog reset digital core and rtc module*/
    case 19 : Serial.print(" GLITCH_RTC_RESET");break;        /**<19, glitch reset digital core and rtc module*/
    case 20 : Serial.print(" EFUSE_RESET");break;             /**<20, efuse reset digital core*/
    case 21 : Serial.print(" USB_UART_CHIP_RESET");break;     /**<21, usb uart reset digital core */
    case 22 : Serial.print(" USB_JTAG_CHIP_RESET");break;     /**<22, usb jtag reset digital core */
    case 23 : Serial.print(" POWER_GLITCH_RESET");break;      /**<23, power glitch reset digital core and rtc module*/
    default : Serial.print (" NO_MEAN");
  }
}
void my_verbose_print_reset_reason(int reason)
{
  switch (reason)
  {
    case 0  : Serial.print ("none"); break;
    case 1  : Serial.print ("Vbat power on reset");break;
    case 3  : Serial.print ("Software reset digital core");break;
    case 4  : Serial.print ("Legacy watch dog reset digital core");break;
    case 5  : Serial.print ("Deep Sleep reset digital core");break;
    case 6  : Serial.print ("Reset by SLC module, reset digital core");break;
    case 7  : Serial.print ("Timer Group0 Watch dog reset digital core");break;
    case 8  : Serial.print ("Timer Group1 Watch dog reset digital core");break;
    case 9  : Serial.print ("RTC Watch dog Reset digital core");break;
    case 10 : Serial.print ("Instrusion tested to reset CPU");break;
    case 11 : Serial.print ("Time Group reset CPU");break;
    case 12 : Serial.print ("Software reset CPU");break;
    case 13 : Serial.print ("RTC Watch dog Reset CPU");break;
    case 14 : Serial.print ("APP CPU reset by PRO CPU");break;
    case 15 : Serial.print ("Reset when the vdd voltage is not stable");break;
    case 16 : Serial.print ("RTC Watch dog reset digital core and rtc module");break;
    default : Serial.print ("other "); Serial.print(reason);
  }
}


/* 
 * parts below were created by softhack007, licended under GPL v3.0
 */

void show_psram_info_part1(void)
{
#if defined(BOARD_HAS_PSRAM) || defined(WLED_USE_PSRAM)
  //if (esp_spiram_is_initialized() == false) esp_spiram_init();
  Serial.println(psramFound() ? "ESP32 PSRAM: found.": "ESP32 PSRAM: not found!"); 
  if (!psramFound()) return;
  psramInit();

  // the next part only works on "classic" ESP32
  #if !defined(CONFIG_IDF_TARGET_ESP32S3) && !defined(CONFIG_IDF_TARGET_ESP32S2)  && !defined(CONFIG_IDF_TARGET_ESP32C3)
  #if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(4, 0, 0)
    esp_spiram_size_t my_psram_size;
    if (esp_spiram_is_initialized() == false) esp_spiram_init();
    my_psram_size = esp_spiram_get_chip_size();
    switch (my_psram_size) {
      case ESP_SPIRAM_SIZE_16MBITS: Serial.println("* SPI RAM Chip availeable: 16MBits = 2MBytes"); break;
      case ESP_SPIRAM_SIZE_32MBITS: Serial.println("* SPI RAM Chip availeable: 32MBits = 4MBytes"); break;
      case ESP_SPIRAM_SIZE_64MBITS: Serial.println("* SPI RAM Chip availeable: 64MBits = 8MBytes"); break;
      case ESP_SPIRAM_SIZE_INVALID: Serial.println("* SPI RAM size is invalid"); break;
      default: Serial.print("* ?SPI RAM size is unknown (0x"); Serial.print(my_psram_size, HEX); Serial.println(")"); break;
    }
  #endif
  #endif
#endif
}

