Aircoookie/WLED/tools/ESP32-Chip_info.hpp
void show_psram_info_part2(void)
{
#if defined(BOARD_HAS_PSRAM) || defined(WLED_USE_PSRAM)
  if (!psramFound()) return;

  // usually the next part won't work ...
  #ifdef PSRAM_MODE
    switch (PSRAM_MODE) {
      case PSRAM_VADDR_MODE_NORMAL:  Serial.println("*  PSRAM mode = PSRAM_VADDR_MODE_NORMAL"); break;
      case PSRAM_VADDR_MODE_LOWHIGH: Serial.println("*  PSRAM mode = SRAM_VADDR_MODE_LOWHIGH"); break;
      case PSRAM_VADDR_MODE_EVENODD: Serial.println("*  PSRAM mode = PSRAM_VADDR_MODE_EVENODD"); break;
    }
  #endif
  #ifdef PSRAM_SPEED
    switch (PSRAM_SPEED) {
      case PSRAM_CACHE_F40M_S40M: Serial.println("*  PSRAM speed = PSRAM_CACHE_F40M_S40M  -> speed=40 esptool_flash=40 (by config)"); break;
      case PSRAM_CACHE_F80M_S40M: Serial.println("*  PSRAM speed = PSRAM_CACHE_F80M_S40M  -> speed=40 esptool_flash=80 (by config)"); break;
      case PSRAM_CACHE_F80M_S80M: Serial.println("*  PSRAM speed = PSRAM_CACHE_F80M_S80M  -> speed=80 esptool_flash=80 (by config)"); break;
    }
  #endif

  #if 0  // this test makes the "max used PSRAM" info unusable
  // try to allocate PSRAM (one 640KB chunk so we can be sure it will not fit into DRAM)
  void * buff2 = ps_malloc(640 * 1024);
  uint8_t * buf = (uint8_t*)malloc(620 * 1024);
  Serial.print("* PSRAM free after malloc / ps_malloc : "); Serial.print(ESP.getFreePsram() / 1024.0, 2); Serial.println(" KB (1.2MB allocated)");
  if (buff2 == NULL)
    Serial.println("* can't allocate big memory with ps_malloc()");
  else { 
    Serial.println("* Can allocate big memory with ps_malloc()");
    free(buff2);
  }
  if (buf == NULL)
    Serial.println("* can't allocate big memory with malloc()");
  else { 
    free(buf);
    Serial.println("* Can allocate big memory with malloc()");
  }
  #endif

#endif
}

void showRealSpeed() {
  //Serial.begin(115200);
  Serial.flush();
  Serial.println(F("\n===================================="));
  Serial.print(  F("Chip info for ")); Serial.println(ESP.getChipModel());
  Serial.print(  F("SDK:          ")); Serial.println(ESP.getSdkVersion());
  Serial.println(F("------------------------------------\n"));

  Serial.print(" XTAL FREQ: "); Serial.print(getXtalFrequencyMhz()); Serial.println("   MHz");
  Serial.print(" APB FREQ:  "); Serial.print(getApbFrequency() / 1000000.0, 1); Serial.println(" MHz");
  Serial.print(" CPU FREQ:  "); Serial.print(getCpuFrequencyMhz()); Serial.println("  MHz\n");

  Serial.print("ESP32 DEVICE:    "); Serial.print(my_GetDeviceHardwareRevision());
  Serial.print(F(", ")); Serial.print(ESP.getChipCores()); Serial.print(F(" core(s)"));
  Serial.print(F(", ")); Serial.print(ESP.getCpuFreqMHz()); Serial.println(F("MHz.\n"));
  my_show_chip_info();

  Serial.print("FLASH CHIP FREQ (magic): "); Serial.print(ESP.getFlashChipSpeed()/1000000.0, 1); Serial.println(" MHz");
  Serial.print("FLASH SIZE (magic byte): "); Serial.print(ESP.getFlashChipSize() / (1024.0 * 1024), 2); Serial.println(" MB");
  Serial.print("FLASH MODE (magic byte): "); Serial.print(ESP.getFlashChipMode()); Serial.println(" ;  0=QIO, 1=QOUT, 2=DIO, 3=DOUT or other\n");

  Serial.print("FLASH CHIP ID:   0x"); Serial.println(my_ESP_getFlashChipId(), HEX);
  Serial.print("FLASH CHIP FREQ: "); Serial.print(my_ESP_getFlashChipSpeed() / 1000000.0, 1); Serial.println(" MHz");
  Serial.print("FLASH REAL SIZE: "); Serial.print(my_ESP_getFlashChipRealSize() / (1024.0 * 1024), 2); Serial.println(" MB");
  Serial.print("FLASH REAL MODE: "); Serial.println(my_ESP_getFlashChipMode());

  Serial.println(F("\n------------------------------------"));
  Serial.print(  "RAM HEAP SIZE:  "); Serial.print(ESP.getHeapSize() / 1024.0, 2); Serial.println(" KB");
  Serial.print(  " FREE RAM:      "); Serial.print(ESP.getFreeHeap() / 1024.0, 2); Serial.println(" KB");
  Serial.print(  " MAX RAM alloc: "); Serial.print(ESP.getMaxAllocHeap() / 1024.0, 2); Serial.println(" KB");

#if defined(BOARD_HAS_PSRAM) || defined(WLED_USE_PSRAM)
  Serial.println();
  show_psram_info_part1();
  if (psramFound()) {
    Serial.print("  total PSRAM:    "); Serial.print(ESP.getPsramSize() / 1024.0, 0); Serial.println(" KB");
    Serial.print("  FREE PSRAM:     "); Serial.print(ESP.getFreePsram() / 1024.0, 2); Serial.println(" KB");
    Serial.print("  MAX PSRAM alloc:"); Serial.print(ESP.getMaxAllocPsram() / 1024.0, 2); Serial.println(" KB");
    Serial.print("  used PSRAM:     "); Serial.print(ESP.getPsramSize() - ESP.getFreePsram()); Serial.println(" Bytes");
    Serial.println();
    show_psram_info_part2();
  }
#endif

  Serial.println();
  Serial.print("CPU #0 - last reset reason = ");
  my_print_reset_reason(rtc_get_reset_reason(0)); Serial.print("\t => ");
  my_verbose_print_reset_reason(rtc_get_reset_reason(0));
  Serial.println();
  if (ESP.getChipCores() > 1) {
    Serial.print("CPU #1 - last reset reason = ");
    my_print_reset_reason(rtc_get_reset_reason(1));Serial.print("\t => ");
    my_verbose_print_reset_reason(rtc_get_reset_reason(1));
    Serial.println();
  }

  Serial.println(F("====================================\n"));
  Serial.flush();
}


#else
  #error this tool only supports ESP32 chips
#endif